In [84]:
import pandas as pd
df=pd.read_csv("Churn_Modelling.csv")
df.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

# CREAT DUMMY VARIABLES AND ENCODING

In [86]:
Geography=pd.get_dummies(df['Geography'])
Gender=pd.get_dummies(df['Gender'])

In [89]:
Gender

      Female  Male
0          1     0
1          1     0
2          1     0
3          1     0
4          1     0
...      ...   ...
9995       0     1
9996       0     1
9997       1     0
9998       0     1
9999       1     0

[10000 rows x 2 columns]

In [90]:
#concate the dataset
df=pd.concat([df, Geography, Gender], axis=1)
df.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,France,Germany,Spain,Female,Male
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1,1,0,0,1,0
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0,0,0,1,1,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1,1,0,0,1,0
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0,1,0,0,1,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0,0,0,1,1,0

In [91]:
#dropping unesecerry colum
df=df.drop(['Geography', 'Gender'], axis=1)
df.head()

,RowNumber,CustomerId,Surname,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,France,Germany,Spain,Female,Male
0,1,15634602,Hargrave,619,42,2,0.00,1,1,1,101348.88,1,1,0,0,1,0
1,2,15647311,Hill,608,41,1,83807.86,1,0,1,112542.58,0,0,0,1,1,0
2,3,15619304,Onio,502,42,8,159660.80,3,1,0,113931.57,1,1,0,0,1,0
3,4,15701354,Boni,699,39,1,0.00,2,0,0,93826.63,0,1,0,0,1,0
4,5,15737888,Mitchell,850,43,2,125510.82,1,1,1,79084.10,0,0,0,1,1,0

# INDEXING

In [ ]:

df.set_index("RowNumber", inplace=True)
df.head()

# DROPING

In [ ]:
df.drop(["CustomerId", "Surname"] ,axis=1, inplace=True)
df.head()

In [ ]:
df.describe()

# Age category
Exited category
Geography category
Balance Category
Tenure Category
Credit score

In [ ]:
#df.loc[df['Age']>=0:"Age"]="Children"
#df.head()

In [ ]:
Age_df=df[(df['Age']>= 18) & (df["Age"]<=29)]
Age_df.head()

In [ ]:
Age_df['Gender'].value_counts()

In [ ]:
print("In this dataset (Raw & Colum): " ,df.shape)

In [ ]:
df.info()

In [ ]:
df.isnull().sum()

# ANALYSIS FROM GEOGRAPHY

In [ ]:
df["Geography"].unique()

In [ ]:
df["Geography"].value_counts()

In [ ]:
Geography_df=df[df["Geography"]=="France"]
Geography_df.head()

In [ ]:
Geography_df["Gender"].value_counts()

In [ ]:
Geography_df["Age"].value_counts()

In [ ]:
Geography_df["Age"].mean()

In [ ]:
Geography_df["Age"].mode()

In [ ]:
Geography_df["Age"].median()

In [ ]:
Geography_df["Exited"].value_counts()

In [ ]:
Geography_df["IsActiveMember"].value_counts()

# GERMANY

In [ ]:
Geography_df=df[df["Geography"]=="Germany"]
Geography_df.head()

In [ ]:
Geography_df["Gender"].value_counts()

In [ ]:
Geography_df.shape

In [ ]:
Geography_df["Age"].value_counts()

In [ ]:
Geography_df["Age"].mean()

In [ ]:
Geography_df["Age"].mode()

In [ ]:
Geography_df["Age"].median()

In [ ]:
Geography_df["IsActiveMember"].value_counts()

In [ ]:
Geography_df["Exited"].value_counts()

# SPAIN

In [ ]:
Geography_df=df[df["Geography"]=="Spain"]
Geography_df.head()

In [ ]:
Geography_df["Gender"].value_counts()

In [ ]:
Geography_df["Age"].value_counts()

In [ ]:
Geography_df["Age"].mean()

In [ ]:
Geography_df["Age"].mode()

In [ ]:
Geography_df["Age"].median()

In [ ]:
Geography_df["IsActiveMember"].value_counts()

In [ ]:
Geography_df["Exited"].value_counts()

# Gender

In [ ]:
df["Gender"].unique()

In [ ]:
df["Gender"].value_counts()

In [ ]:
Gender_df=df[df["Gender"]=="Male"]
Gender_df.head()

In [ ]:
Gender_df['Age'].unique()

In [ ]:
Gender_df['Age'].mean()

In [ ]:
Gender_df['Age'].median()

In [ ]:
Gender_df['Age'].mode()

In [ ]:
Gender_df['Geography'].unique()

In [ ]:
Gender_df['Geography'].value_counts()

In [ ]:
Gender_df['Exited'].value_counts()

In [ ]:
Gender_df['EstimatedSalary'].value_counts()

In [ ]:
Gender_df['Balance'].value_counts()

In [ ]:
Gender_df['HasCrCard'].value_counts()

In [ ]:
Gender_df['Tenure'].value_counts()

In [ ]:
Gender_df['NumOfProducts'].value_counts()

# FEMALE

In [ ]:
Gender_df=df[df["Gender"]=="Female"]
Gender_df.head()

In [ ]:
Gender_df['Age'].mean()

In [ ]:
Gender_df['Age'].mode()

In [ ]:
Gender_df['Age'].median()

In [ ]:
Gender_df['Geography'].value_counts()

In [ ]:
Gender_df['Exited'].value_counts()

In [ ]:
Gender_df['EstimatedSalary'].value_counts()

In [ ]:
Gender_df['IsActiveMember'].value_counts()

In [ ]:
Gender_df['Balance'].value_counts()

In [ ]:
Gender_df['HasCrCard'].value_counts()

In [ ]:
Gender_df['Tenure'].value_counts()

In [ ]:
Gender_df['NumOfProducts'].value_counts()

# ACTIVE MEMBERS

In [ ]:
df['IsActiveMember'].value_counts()

In [ ]:
df['HasCrCard'].value_counts()

In [ ]:
df['NumOfProducts'].value_counts()